label ch3day3:
    "Остров уплывал всё дальше и дальше. {w} Точнее это мы уплывали от острова, хотя казалось и наоборот."
    "Мы оказались в открытом море. Собственно, после крушения я ни разу не оказывался в море. {w} Прошло всего лишь несколько дней, но кажется, что пролетели года с того дня, когда всё поменялось. {w}  Я столько пережил, столько узнал, столько увидел."
    "Я окинул взглядом бескрайний океан. {w} Оно того стоило? {w} Я столько сотворил, ещё не поздно остановиться."
    call flashback4
    "Какой же мразью я был... {w} Именно поэтому, хотя бы это я должен для неё сделать. Хотя бы в этом я должен быть/стать хорошим братом!"
    "Крепко сжав кулаки, я посмотрел вперёд."
