label ch3day3:
    "Остров уплывал всё дальше и дальше. {w}Точнее это мы уплывали от острова, хотя казалось и наоборот."
    "Мы оказались в открытом море. Собственно, после крушения я ни разу не оказывался в море. {w}Прошло всего лишь несколько дней, но кажется, что пролетели года с того дня, когда всё поменялось.{w}  Я столько пережил, столько узнал, столько увидел."
    "Я окинул взглядом бескрайний океан. {w}Оно того стоило? {w}Я столько сотворил, ещё не поздно остановиться."
    # pomis: Не стоит отделять{w}пробелами с обеих сторон.
    # pomis: в игре это будет выглядеть так: "отделять  пробелами"
    call flashback4
    "Какой же мразью я был... {w}Именно поэтому, хотя бы это я должен для неё сделать. Хотя бы в этом я должен быть хорошим братом!"
    # bulka: Хз, какой глагол подойдёт.
    # pomis: Наверное, всё-таки быть
    "Крепко сжав кулаки, я посмотрел вперёд."
    "Я отомщу за тебя. И за родителей. За всех, кто умер из-за действий этих военных."
    "Хотя. Плевать на остальных. Я готов пожертвовать чужими жизнями ради своей цели."
    "На горизонте, по правой стороне, показался корабль."
    "— Что-то не больно не больно похоже на технологии Инферно!"
    pav "— Вот чёрт!"
    "Павел резко развернул лодку в противоположную сторону."
    pav "— Это обманка для отвлечения внимания. И мы рядом с ним!"
    # pomis: что за обманка? Вкурить не могу
    "Чудесно. Только в центр сражения угодить не хватало. Сусанин вашу ж мать!"
    "Корабль скорее напоминал цельный кусок металла, чем корабль."
    "Понятия не имею, чьи это технологии. Не думаю, что люди способны изготовить такой уродливый корабль."
    # pomis: тем временем, на корабле происходит резня.
    "Мы же уплывали в открытое море. Надеюсь, на корабле нас не заметили."
    "— Ты знаешь, куда плыть?"
    pav "— Примерно."
    "— Ты настолько ценен для Инферно, что ради тебя организовали такую спасательную операцию?"
    pav "— Просто они не бросают своих. У них другой менталитет."
    "Кажется, он их идеализирует."
    # gen "— Неизвестное судно, приём. Сообщите код доступа или будете уничтожены."
    # bulka: Хз, вообще никак не выходит\