label ch3day3:
    "Остров уплывал всё дальше и дальше. {w} Точнее это мы уплывали от острова, хотя казалось и наоборот."
    "Мы оказались в открытом море. Собственно, после крушения я ни разу не оказывался в море. {w} Прошло всего лишь несколько дней, но кажется, что пролетели года с того дня, когда всё поменялось. {w}  Я столько пережил, столько узнал, столько увидел."
    "Я окинул взглядом бескрайний океан. {w} Оно того стоило? {w} Я столько сотворил, ещё не поздно остановиться."
    call flashback4
    "Какой же мразью я был... {w} Именно поэтому, хотя бы это я должен для неё сделать. Хотя бы в этом я должен быть/стать хорошим братом!"
    # bulka: Хз, какой глагол подойдёт.
    "Крепко сжав кулаки, я посмотрел вперёд."
    "На горизонте, по правой стороне, показался корабль."
    "— Что-то не больно не больно похоже на технологии инферно."
    pav "— Вот чёрт!"
    "Павел резко развернул лодку в противоположную сторону."
    pav "— Это обманка для отвлечения внимания. И мы рядом с ним!"
    "Чудесно. Только в центр сражения угодить не хватало. Сусанин вашу ж мать!"
    # gen "— Неизвестное судно, приём. Сообщите код доступа или будете уничтожены."
    # bulka: Хз, вообще никак не выходит\