label ch4inferno_day0:
    # bulka: Тут уже попаданчество в город инферно и тд.
    "Очнулся я вовсе не от приятных ощущений." 
    "Знаете неприятное ощущение, когда конечность затекает? Когда ничего ею не чувствуется, кроме того, как её щиплет? А теперь представьте такое ощущение во всём теле, кроме головы. Голову же будет разрывать на части, будто вы вчера неслабо так надрались. Представили?{w} Вот это примерно я ощущал в тот момент."
    "Рядом я {i}почувствовал{/i} какое-то движение." 
    "Нет, не ощутил движения воздуха, не услышал шороха одежды или звука шагов, не увидел кого-то, а именно {i}почувствовал{/i}.{w} Каким-то образом я понял, что рядом со мной лежит кто-то примерно в том же состоянии. Но как я это понял?"
    "Ладно, отложим этот вопрос до дальнейшего разъяснения. Важнее понять, что сейчас происходит и где я нахожусь.{w} Мы направлялись в столицу Инферно."
    "Мы? Точно, со мной же был Павел. Тогда где он? Это он лежит рядом? Скорее всего."
    "Тогда где мы лежим?{w} Последнее что я запомню - это тьма, в которую мы провалились после моего вопроса."
    "Нас усыпили? Вполне возможно, что головная боль это отходняк от препарата, коим нас усыпили."
    "Но зачем? Чтобы мы не могли рассказать, где находится их столица?{w} Вряд ли. Слишком много геммора ради нас двоих. Да и зачем это испытание на острове тогда?"
    "Блин, слишком много вопросов и что-то я сомневаюсь, что смогу найти на них ответы просто лёжа здесь. Но что я могу сделать будучи в таком состоянии? Хотя бы голова перестала болеть - уже что-то."
    "Тут я почувствовал небольшую боль в шее. Будто бы небольшой укол. Хэй, уже что-то!"
    # bulka: Так. Небольшой план тут. Телепорт баганул/нейроинты/нейронты/ещё что-то, но короче во время тп часть нервных клеток Павла оказалось в гг, а часть нервных клеток гг оказалась в Павле. Теперь они чуят друг друга на расстоянии. Хз зачем это и почему, просто пришло в голову. Мб как-то обыграю. Щас почему-то я слишком сонный, ёкараны бабай.