#
#   КОНСЕРВЕД
#

label ch5nightmare:
    # Инфернцы умеют создавать управляемые сны подключив жертву к специальному оборудованию. 
    # Они могут заставить мозг воссоздать окружение сна основываясь на самых ярких эмоциях, воспоминаниях, переживаниях и мечтах жертвы. Мощность оборудования помогает сделать эти сны максимально реалистичными. 
    # Память человека — довольно сложная структура данных, и вытащить напрямую какой-то конкретный факт имеющимися у Инферно технологиями почти нереально, поэтому они используют внушение.
    # Да, частично плагиат фильма Начало
    # bulka: Чёт даже не подумал о плагиате, когда читал.
    "От резкой боли я вскочил с кровати."
    sis "— Ого, ты наконец-то очнулся!"
    "Тоня несколько секунд смотрела на меня как на приведение, а затем залилась слезами и бросилась на меня."
    sis "— Я уж думала, ты никогда не очнёшься. Уже три месяца прошло с кораблекрушения!"
    "— Это всё был кошмар? Поверить не могу..."
    sis "— Что — всё?"
    "Радостное лицо сестры наполнилось любопытством."
    "— Да... уже неважно. Как там родители?"
    sis "— Тоже долго были без сознания. Но гораздо дольше всех пропадал ты."
    # bulka: Пропадал? Проспал мб?
    "— А мне снилось, что все кроме меня погибли..."
    sis "— Размечтался. Не в то время живём, сейчас спасатели очень крутые! Почти всех удалось найти и откачать!"
    # bulka: А вот это всё плагиатом попахивает. Довольно часто встречаемым даже. Сразу дневник вспомнился, но уверен, что такой приём часто практикуется. В кроссовере флэша, стрелы и легенд завтрашнего дня тоже такое было.
    # Осталось придумать, что и как инфернцы будут пытаться узнать
    # bulka: Не сказал бы, что у героя есть какя-то информация, которую требовалось бы узнать.
    jump ch6day0