label chNinferno:
    # Разговор после ухода гг:
    sa "— Хилос, ты не думаешь, что доверять такое ответственное задание новичку не слишком разумно?"
    # bulka: Не знаю, может поменять местами Саргона и Хилоса в этом диалоге? Или вместо Саргона поставить Скадрона? Или вообще Павла?
    # bulka: Вопрос ещё актуален. 
    no1 "— Боишься, что он провалит задание?"
    sa "— Именно. Это слишком важный этап плана, чтобы доверять его человеку. Особенно тому, кого только-только завербовали."
    no1 "— Напротив. Выгоднее доверить это человеку, нежели одному из нас. Если он выполнит задание - отлично, если же провалится, то всё равно успех. Даже если его схватят после выполнения задания - нам будет выгодно."
    "Лицо Саргона выражало сомнение."
    sa "— О чём ты?"
    no1 "— Как думаешь, что произойдёт, если человека схватят при попытке убийства принцессы? Даже если она выживет, её позиции пошатнутся, и она перестанет быть помехой. Как бы не легли карты, нам это будет выгодно."
    sa "— Тогда не было бы лучше послать Павла? Всё же ему больше доверия."
    no1 "— Из-за этого в том числе его и стоит оставить. Павел более пригоден для разведывательных миссий и менее импульсивен. Жалко терять такой актив. Новичок же удобно подвернулся под руку и его потеря никак не помешает нашим дальнейшим действиям. Когда продумывался план, его не учитывали. Он - случайная величина в сложном уравнении. Лучше избавиться от него раньше, чем пойдут круги по воде."
    # bulka: Не слишком ли много метафор?
    # pomis: зависит от характера персонажа
    sa "— Что ж. Время покажет."
    no1 "— Время покажет."