label revolve:
    "В комнату заходило всё больше людей. Судя по металлическому стуку, сопровождавшему их движения, многие были вооружены."
    "Мы сидели с Марией спрятавшись под столом, пытаясь не издавать ни звука."
    sa "– Ну всё, все ключевые узлы базы полностью под нашим контролем."
    sa "— Устранить всех, чья верность Инферно вызывает сомнения!"
    "Толпа в разнобой выразила возгласы одобрения."
    "Так значит, этот Саргон — какая-то большая шишка в Инферно? Если его убить, то моя месть будет считаться свершённой? Думаю, что нет. Его место просто займёт кто-то другой."
    # pomis: вот только это лишь одно из управляемых тел Саргона.

    return