image bg night ocean = "images/oceanNight.jpg"
image bg copter = "images/copter.jpg"
define s = Character('Сосед', color="#c8ffc8")
label rootInferno:
    "Юминг посмотрела на меня испепеляющим взглядом."
    yu "—Ты что, совсем дурной?? Чтобы вызвать военных, чтобы нас спасли!"
    yu "—Чтобы ты вступил в армию и воевал за спокойствие людей! Быстро взял в руки мультипаяльник и за работу!"

    "—А если я не хочу вам помогать? Вы уничтожили их город, теперь расплачивайтесь!"

    "—Защищаешь этих тварей??"
    "Она замахнулась, чтобы дать мне пощечину."
    yu "— Ладно... Ты наверное ещё не осознал происходящее... А я сразу давлю на тебя..."
    "Её тон опять сменился. Поразительно, как быстро меняется настроение у этой девушки. Но помогать ей я ни в коем случае не собирался. Она потопила корабль..."
    "Именно из-за неё я сейчас могу умереть. Тут у меня предательски заурчал живот. "
    yu "—Кушать хочешь?"
    "Юминг начала рыться в кейсах. Всё что она нашла это две бутылки воды и растаявший сырок."
    yu "— А-ха-ха-ха! Как глупо было его брать с собой на задание! Давай поделим всё пополам?"
    "Она смотрела на меня добродушно и дружелюбно. "
    "Но сейчас она вызывала у меня только отвращение. Её улыбка не вернёт меня на корабль, и уж тем более, домой."

    "—Знаешь... — Я взял в руки сломанный передатчик, осматривал его. — Думаю, я смогу справиться с этой штуковиной."

    "—Ураа, я знала, что ты сможешь."
    "В глазах этой загадочной китаянки заиграла радость. "
    "— Посмотри в том кей..."
    "Её полный энтузиазма голос заглох после звука тупого удара передатчика о её висок. Я столкнул дрожащими руками её обездвиженное тело в воду. "
    "Это было довольно тяжело, так как её костюм на половину состоял из металлических деталей, однако, благодаря этому, она сразу пошла ко дну."
    "Я провожал взглядом расплывающийся в толще воды контур её тела... "
    "По немногу я приходил в себя. Всё тело охватила дрожь, что же я натворил? За что? Неужели я способен вот так просто убить человека?"
    "Всю свою жизнь я не причинял никому боли, даже не дрался ни с кем... А сейчас приступ слепой ярости ударил в голову, и что самое страшное, я даже не чувствую своей вины."
    
    "Может, это из-за жары и изнеможения? Постепенно я отключился..."
    scene bg night ocean with fade 
    "Проснулся я от брызгов солёной воды попавших мне в лицо: в море разыгрались волны, конечно, не такие большие, чтобы представлять какую-то опасность для моей лодки..."
    "Уже наступила ночь, лишь только звёзды и луна хоть как-то освещали бесконечную водную поверхность. "
    "Вокруг не виднелось даже и намёка на берег. Я вспоминал события прошедшего дня, ужасаясь от своего поступка. В тусклом лунном свете я стал рыться в разбросанных ящиках. "
    "Должно же в них быть хоть что-то, что могло бы помочь мне выбраться? Один хлам! И вообще... Эта сумашедшая китаянка затопила наш лайнер, но почему же я один на лодке в куче хлама? "
    "Выжили ли остальные? Боюсь, что я никогда не узнаю ответы на эти вопросы. А может, уже организовали спасательную экспедицию? Не мог же я далеко уплыть на этой лодке? Точно! "

    "—Меня точно спасут!"
    "Я нервно засмеялся, постепенно мой смех переходил в истерику. Я стал сбрасывать ящики с хламом за борт, как днём сбросил причину моего незавидного положения."

    "—Сброшу все эти странные вещи, чтобы не вызывать лишних вопросов, если меня всё таки спасут."
    "Вгляд упал на растаявший сырок. У меня всё сжалось внутри... Живой человек взял его с собой чёрт знает откуда, а я лишил этого человека жизни. "
    "У меня предательски заурчало в животе. Неужели придётся есть это?"

    "Пытаясь убедить себя, что у предметов нет памяти, если только это не запоминающее устройство, я заставил себя съесть этот сырок. "
    "На обёртке было что-то по китайски написано."

    "Оставшаяся ночь была самой кошмарной за всю мою жизнь — я остался один на один со своей совестью. {w}Хоть я и был атеистом, мне казалось, что теперь мне обязательно вернётся моё зло. "
    "И даже аргумент, что из-за Юминг погибли люди был уже не убедителен для меня. "

    scene bg copter with dissolve
    "Утром меня разбудил шум пролетающего вдали вертолёта. Он пролетал совсем далеко, и на приличной высоте, должно быть, чтобы площадь обзора была больше. "
    "В таком случае, он быстро заметит меня. Если, конечно, это действительно спасатели... Я всячески привлекал внимание, махал руками, кричал, хоть я и понимал, что это не поможет, но всё равно, я не мог спокойно сидеть на месте."

    "Меня и остальных выживших доставили в Испанию, власти которой и организовали спасательную операцию. {w}Около двадцати человек, в основном, россияне. "
    "Я не стал ни с кем разговаривать. Какая-то дама безостановочно рыдала, да и у других вид был не лучше."

    "Нас везли в больницу в какой-то испанский город, названия я не запомнил, да и голова была загруженна другими мыслями. "
    "Я поставил себе цель пройти тест на возможность управления тем странным оборудованием. Китаянка говорила о каком-то тесте на вирус в своей провинции..."
    "Если доберусь до интернета, то без проблем найду информацию даже в китайском сегменте, благо современными инструментами поиска я хорошо владею. "
    "А может, кто в больнице знает про эту проверку? Погруженный в свои мысли, я даже не заметил, как мы приехали. Наша больница представляла собой несколько десятков небольших корпусов, должно быть, разные отделения находились в отдельных корпусах."
    "А где тут интернет? Должны же нам дать хоть какие-то средства связи! "

    "Панический настрой улетучился, когда нас привели в корпус, где проходит регистрация. Всё было оборудованно настолько современно, насколько это возможно."
    "Под потолком летали небольшие коптеры, расносили какие-то бумаги, баночки. Наверное, они и между корпусами летают, но я не обратил внимание. "
    "Интересное решение, у себя я такого никогда не видел. Зарегистрировали нас быстро, спросили информацию о родных, чтобы сообщить им о случившемся. Я соврал, что давно с ними в ссоре, и не хочу их тревожить. "

    "Меня заселили в просторную двухместную палату. На соседней кровати были разбросанны рваные куски каких-то тряпок, самого же соседа в палате не было. Уже было поздно. "
    "Стоило мне коснуться постели, как глаза сами стали закрываться и я провалился в сон. {w}Однако сильная усталось не помешала недавним событиям повториться во сне. Я сбрасывал Юминг с лодки, а потом падал вместе с ней, падал в бездну, просыпался, снова засыпал. И так несколько раз."

    "На следующий день нам пообещали, что вернут в Россию так скоро, как проведут все тесты и необходимое лечение. "
    "Однако, мне повезло больше чем другим, и я не получил никаких серьёзных повреждений, даже эмоционально я казался невозмутимым на фоне остальных. "
    "Это такое свойство интроверта — все переживания происходят внутри, снаружи их заметить довольно тяжело, если не знаешь человека. "
    "..."
    "Завтрак был неплохим: какие-то местные фрукты и чай. {w}Я отнёс посуду и вышел из столовой. Куда теперь направиться?"
    menu:
        "Обратно в палату": 
            $ lazynessPoints += 1
            "Что-то меня совсем в сон клонит... Вздремну-ка я часок..."
            "Неспешными шагами направился в сторону своей палаты"
            "Лениво открываю дверь в палату"
            "Передо мной появляется высокий мужчина, на вид лет сорока"
            s "—Здарова, по-русски говоришь?"
            menu:
                "Да, земляк!":
                    "—Да, земляк. Можно пройти?"
                    s "—О-о! Я так рад. А то совсем не понимаю этих испанцев. Всю жизнь только по-русски говорю."
                    "—Даже английского не знаете?"
                    s "—Нет!"
                    "Сосед засмеялся"
                    s "–Меня привезли почти сразу после крушения, а ты, небось сутки в воде провёл? Хотя...{w} Видок у тебя здоровый"
                    "—Мне повезло попасть на лодку..."
                    s "Ах ты засранец!"
                    with vpunch
                    "Сосед засмеялся ещё громче и похлопал меня по плечу"
                    s "—А что, собственно, произошло с кораблем?"
                    "—Помню только взрывы..."
                    "Произнося это я рухнул в кровать и отключился"
                "Сейчас я хочу только спать":
                    "Я пробурчал, что хочу спать и попытался обойти его, случайно задев плечом"
                    s "Хааа, ты тоже русский!"
                    "Сосед громко засмеялся. Я тем временем рухнул на кровать и притворился спящим, чтобы сосед отстал. {w}Через минуту я отключился"
                "Промолчать":
                    "Я притворился, что не понимаю его, аккуратно обошёл его и рухнул на кровать."
        "Прогуляться":
            "Интересно, в этой стране всегда такая хорошая погода? Любуясь видом из окна, решаю прогуляться"
            "Выходя из корпуса чуть не сбиваю с ног пожилого врача"
            "—Ой... Простите!"
            "Пытаюсь помочь ему встать, но он отмахивается от меня и ругаетсяс на своём языке. Хорошо, что я ни слова не понял"
            "..."
            ""
    "<описание скучно пройденного дня>"
    "<дорвался до интернета>"